Tekla Open API Reference for Tekla Structures 2025
Solid Methods
The Solid type exposes the following members.
Methods
Name | Description
GetAllIntersectionPoints
 Used to get all the intersection points between the solid and a plane. Does not arrange the points into polygons, thus a lot faster.
GetCutPart
 Returns a shell enumerator for the solid th at results cutting this solid with the given solid.
GetEdgeEnumerator
 Returns a new edge enumerator in the current plane.
GetFaceEnumerator
 Returns a new face enumerator in the current plane.
Intersect(LineSegment)
 Returns a list of line - solid intersection points.
Intersect(Point, Point)
 Returns a list of line - solid intersection points.
Intersect(Point, Point, Point) |  Obsolete.
 Returns a list of plane - solid intersection points. The first item of the list contains a list of the outmost intersection polygon and the rest of the items (if there are any) inner polygons.
IntersectAllFaces
 Returns an enumerator for an array list of lists of plane - solid intersection points from all intersecting faces. The first item of one list contains points of the outmost intersection polygon and then the inner polygons (if there are any).
IsValid
 Returns if the solid is valid.
Top
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace